[
    {
        "title": "HTML",
        "content": "HTML (HyperText Markup Language) — стандартизованный язык разметки, который позволяет создавать и структурировать веб-страницы. 1 Он помогает определять, как содержимое страницы должно отображаться в браузерах. 2\r\n\r\nОснову HTML составляют теги — это единицы разметки, которые сообщают браузеру, как отображать содержимое документа. Обычно они состоят из имени тега, заключённого в угловые скобки, например &amp;lt;p&amp;gt; для абзаца или &amp;lt;img&amp;gt; — для изображения. ",
        "image": "67ff704adea5b_html_1920_1031_jpg_0_100.jpg",
        "likes": 3
    },
    {
        "title": "Как начать программировать на PHP",
        "content": "PHP - один из самых популярных языков для веб-разработки. В этой статье мы разберём основы синтаксиса, установку сервера и напишем первый &amp;amp;quot;Hello, World!&amp;amp;quot;",
        "image": "pork.png",
        "likes": 0
    },
    {
        "title": "10 лучших фреймворков для фронтенд-разработки в 2024 году",
        "content": "React, Vue, Svelte или SolidJS? В этом обзоре сравним популярные инструменты для создания современных веб-приложений и поможем выбрать подходящий.",
        "image": "02.jpg",
        "likes": 7
    },
    {
        "title": "Оптимизация SQL-запросов: практические советы",
        "content": "Медленные запросы могут убить производительность приложения. Узнайте, как правильно индексировать таблицы, избегать N+1 проблемы и использовать EXPLAIN.",
        "image": "https:\/\/example.com\/images\/sql-optimization.jpg",
        "likes": 0
    },
    {
        "title": "Docker для начинающих: развертывание проекта",
        "content": "Docker упрощает разработку и деплой приложений. В этом руководстве настроим контейнер с PHP, Nginx и MySQL для локальной разработки.",
        "image": "https:\/\/example.com\/images\/docker-guide.jpg",
        "likes": 4
    },
    {
        "title": "Как защитить API от атак: лучшие практики",
        "content": "JWT, OAuth2, rate limiting и CORS. Разбираем основные угрозы и способы защиты RESTful API от злоумышленников.",
        "image": "https:\/\/example.com\/images\/api-security.jpg",
        "likes": 0
    }
]